      *----------------------------------------------------------------*
      * PROGRAMA..: T99PC999.
      * ANALISTA..: F0739509 André Luis Rodrigues de magalhães
      * AUTOR.....: F0739509 André Luis Rodrigues de magalhães
      * DATA......: 03.08.2022
      * COMPILACAO: 52 - PSOSE600 - Cobol 4.2 c/otimizacao p/producao
      * OBJETIVO..: Teste de cobertura de programa BATCH
      *-----------------------------------------------------------------
      * Vrs Data     Ação  Responsável     Descrição da versão
      * --- -------- ----- --------------- -----------------------------
      * 002 04.08.22       F0739509-ANDRE  IMPLEMENTAÇÃO DA OPERAÇÃO DE
      *                                    DIVISÃO.
      * 001 03.08.22 TESTE F0739509-ANDRE  IMPLEMENTAÇÃO.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
       IDENTIFICATION DIVISION.
      *-----------------------------------------------------------------
       PROGRAM-ID. T99PC999.
      *-----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *-----------------------------------------------------------------
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
       DATA DIVISION.
      *-----------------------------------------------------------------
       FILE SECTION.
      *-----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *-----------------------------------------------------------------
      ******************************************************************
      ************** Tabela lista de programas chamados ****************
      ******************************************************************
       01 TAB-PROGRAMAS-CHAMADOS.
          03 SBDATA                         PIC  X(08) VALUE 'SBDATA'.
          03 SBVERSAO                       PIC  X(08) VALUE 'SBVERSAO'.
       01 CTE-PROG                          PIC  X(17) VALUE
                                                    '*** T99PC999 ***'.
       01 CTE-VERS                          PIC  X(06) VALUE 'VRS001'.
      *-----------------------------------------------------------------
       LOCAL-STORAGE SECTION.
      *-----------------------------------------------------------------
       01 FUNCAO          PIC  X(03) VALUE 'F01'.
      *-----------------------------------------------------------------
       LINKAGE SECTION.
      *-----------------------------------------------------------------
       01  DFHCOMMAREA.
-INC T99KC999
      *-----------------------------------------------------------------
       PROCEDURE DIVISION USING DFHCOMMAREA.
      *-----------------------------------------------------------------
       0000-INICIO SECTION.
           CALL SBVERSAO USING CTE-PROG CTE-VERS
           MOVE  0 TO  RESULTADO.
      *-----------------------------------------------------------------
       1000100-ADICAO.
      *-----------------------------------------------------------------
           IF ADICAO
               ADD OPERANDO-1 TO RESULTADO
               ADD OPERANDO-2 TO RESULTADO
           END-IF.
      *-----------------------------------------------------------------
       1000200-SUBTRACAO.
      *-----------------------------------------------------------------
           IF SUBTRCAO
               ADD OPERANDO-1 TO RESULTADO
               SUBTRACT
                   OPERANDO-2
                   FROM
                   RESULTADO
           END-IF.
      *-----------------------------------------------------------------
       1000300-MULTIPLICAO.
      *-----------------------------------------------------------------
           IF MULTIPLICACAO
                   COMPUTE
                   RESULTADO =
                      OPERANDO-1 *
                      OPERANDO-2
           END-IF.
      *-----------------------------------------------------------------
       1000400-DIVISAO.
      *-----------------------------------------------------------------
           IF DIVISAO
                   COMPUTE
                   RESULTADO =
                      OPERANDO-1 /
                      OPERANDO-2
                   ON SIZE ERROR
                   MOVE 1 TO CD-COD-ERRO
                   MOVE 'DIVISÃO POR ZERO' TO MSG-ERRO
           END-IF.
      *-----------------------------------------------------------------
           GOBACK.
      *-----------------------------------------------------------------
       END PROGRAM T99PC999.
      *-----------------------------------------------------------------