      *ESTE EH O BOOK DO WORKING-STORAGE DOS PROGRAMAS FILE HANDLE (FH)
       01 CT.
          03 CT-01                   PIC 99  VALUE ZEROS.
          03 CT-02                   PIC 99  VALUE ZEROS.
          03 CT-03                   PIC 99  VALUE ZEROS.
          03 CT-04                   PIC 99  VALUE ZEROS.
          03 CT-001                  PIC 999 VALUE ZEROS.
       01 ARR01 OCCURS 10 TIMES.
        03 IDD                        PIC 99.
        03 RCRD                      PIC X(3).
