      *ESTE EH O BOOK DO FD DOS PROGRAMAS FILE HANDLE (FH)
       FD IN-FL.
       01 RC.
        03 RC-DT.
         04 RC-DT-Y               PIC 9999 VALUE ZEROS.
         04 RC-DT-M               PIC 99   VALUE ZEROS.
         04 RC-DT-D               PIC 99   VALUE ZEROS.
        03 FILLER                 PIC X.
        03 RC-DESC.
         04 RC-DESC-A             PIC X(64).
         04 RC-DESC-B             PIC X(64).
